fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Более28Дней</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого СтрокаТЗ Из ОтпускаСотрудников Цикл
		Если СтрокаТЗ.ДатаНачала > СтрокаТЗ.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю("ДатаНачала не может быть позднее ДатаОкончания");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
	ВыделитьСтрокиЕслиОтпускБолее28Дней();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыделитьСтрокиЕслиОтпускБолее28Дней() Экспорт
	
	ТаблицаДанных = ЭтотОбъект.ОтпускаСотрудников.Выгрузить();
	
	Для Каждого СтрокаТЗ Из ТаблицаДанных Цикл
		СтрокаТЗ.КоличествоДней = ((СтрокаТЗ.ДатаОкончания - СтрокаТЗ.ДатаНачала) / 86400) + 1;
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Сотрудник", "КоличествоДней");
	
	Для Каждого Строка Из ЭтотОбъект.ОтпускаСотрудников Цикл
		Строка.Более28Дней = Ложь;
	КонецЦикла;
	
	Для Каждого СтрокаТЗ Из ТаблицаДанных Цикл
		
		Если СтрокаТЗ.КоличествоДней <= 28 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", СтрокаТЗ.Сотрудник);
		
		СтрокиСотрудник = ЭтотОбъект.ОтпускаСотрудников.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаСотрудник Из СтрокиСотрудник Цикл 
			СтрокаФормы = ЭтотОбъект.ОтпускаСотрудников.Получить(СтрокаСотрудник.НомерСтроки - 1);
			СтрокаФормы.Более28Дней = Истина;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
